Geoorgiee/contest2026_324_xiaoqiaoliushui/vendor_esp32p4/chips/esp32p4/esp32p4_serial.c
/****************************************************************************
 * vendor/espressif/chips/esp32p4/esp32p4_serial.c
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * ESP32-P4 UART Serial Driver
 *
 * This driver implements the NuttX uart_ops_s interface for the ESP32-P4
 * HP UART peripherals (UART0 and UART1).  The implementation is modeled
 * after the ESP-IDF uart_driver_install() and uart_param_config() APIs.
 *
 * Key features:
 *   - Interrupt-driven TX and RX with FIFO support
 *   - Configurable baud rate, data bits, stop bits, and parity
 *   - RX FIFO timeout detection for efficient byte-by-byte reception
 *   - GPIO matrix pin routing for UART TX/RX signals
 *   - Error detection (parity, framing, overflow)
 *   - Runtime reconfiguration via TCSETS ioctl (including baud rate)
 *
 * ESP-IDF reference:
 *   - examples/peripherals/uart/uart_async_rxtxtasks
 *   - examples/peripherals/uart/uart_echo
 *   - examples/peripherals/uart/uart_events
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/types.h>
#include <stdint.h>
#include <inttypes.h>
#include <stdbool.h>
#include <string.h>
#include <assert.h>
#include <errno.h>
#include <debug.h>

#include <nuttx/irq.h>
#include <nuttx/arch.h>
#include <nuttx/serial/serial.h>
#include <nuttx/clock.h>
#include <termios.h>

#include "riscv_internal.h"
#include "hardware/esp32p4_uart.h"
#include "hardware/esp32p4_clock.h"
#include "hardware/esp32p4_gpio.h"
#include "hardware/esp32p4_soc.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* UART register access macros */

#define UART_REG(uart, reg) \
  (*(volatile uint32_t *)((uart)->base + (reg)))

/* UART FIFO depth - ESP32-P4 HP UART has 128-byte FIFOs */

#define UART_FIFO_MAX           128

/* RX FIFO full threshold - trigger interrupt when this many bytes received.
 * Matching ESP-IDF UART_RXFIFO_FULL_THRHD_DEFAULT (112).
 */

#define UART_RXFIFO_FULL_THRHD  112

/* TX FIFO empty threshold - trigger interrupt when FIFO drops below this.
 * Matching ESP-IDF UART_TXFIFO_EMPTY_THRHD_DEFAULT (8).
 */

#define UART_TXFIFO_EMPTY_THRHD 8

/* RX FIFO timeout threshold (in UART symbol periods).
 * After this many idle bit periods with no new data, an RX timeout
 * interrupt fires.  This allows byte-by-byte reception without waiting
 * for the FIFO to fill.  Value in bits [16:7] of CONF1 register.
 * ESP-IDF default is 2.
 */

#define UART_RX_TOUT_THRHD      2

/* ESP32-P4 UART signal numbers for GPIO matrix routing.
 * These map UART TX/RX signals to GPIO matrix function numbers.
 * UART0 TX = signal 6, UART0 RX = signal 7 (input index)
 * UART1 TX = signal 8, UART1 RX = signal 9 (input index)
 *
 * Reference: ESP32-P4 Technical Reference Manual, GPIO Matrix chapter.
 */

#define UART0_TX_SIG            6
#define UART0_RX_SIG            7
#define UART1_TX_SIG            8
#define UART1_RX_SIG            9

/* Default GPIO pins for UART (ESP32-P4 EV Board default wiring) */

#ifndef CONFIG_ESP32P4_UART0_TX_GPIO
#  define CONFIG_ESP32P4_UART0_TX_GPIO  16
#endif

#ifndef CONFIG_ESP32P4_UART0_RX_GPIO
#  define CONFIG_ESP32P4_UART0_RX_GPIO  17
#endif

#ifndef CONFIG_ESP32P4_UART1_TX_GPIO
#  define CONFIG_ESP32P4_UART1_TX_GPIO  18
#endif

#ifndef CONFIG_ESP32P4_UART1_RX_GPIO
#  define CONFIG_ESP32P4_UART1_RX_GPIO  19
#endif

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* UART port descriptor - holds per-port hardware configuration.
 * This is referenced via dev->priv in all uart_ops callbacks.
 */

struct esp32p4_uart_port_s
{
  uint32_t base;          /* UART register base address */
  int      irq;           /* Interrupt number */
  uint32_t baud;          /* Baud rate */
  uint32_t clk_freq;      /* Source clock frequency (APB clock) */
  uint8_t  parity;        /* Parity: 0=none, 1=odd, 2=even */
  uint8_t  bits;          /* Data bits: 5, 6, 7, or 8 */
  bool     stopbits2;     /* true = 2 stop bits, false = 1 stop bit */
  uint8_t  tx_sig;        /* GPIO matrix TX signal number */
  uint8_t  rx_sig;        /* GPIO matrix RX signal number */
  uint8_t  tx_gpio;       /* GPIO pin for TX */
  uint8_t  rx_gpio;       /* GPIO pin for RX */
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* Serial driver lower-half operations (uart_ops_s interface) */

static int  esp32p4_uart_setup(struct uart_dev_s *dev);
static void esp32p4_uart_shutdown(struct uart_dev_s *dev);
static int  esp32p4_uart_attach(struct uart_dev_s *dev);
static void esp32p4_uart_detach(struct uart_dev_s *dev);
static int  esp32p4_uart_ioctl(FAR struct file *filep, int cmd,
                                unsigned long arg);
static int  esp32p4_uart_receive(struct uart_dev_s *dev, unsigned int *status);
static void esp32p4_uart_rxint(struct uart_dev_s *dev, bool enable);
static bool esp32p4_uart_rxavailable(struct uart_dev_s *dev);
static void esp32p4_uart_send(struct uart_dev_s *dev, int ch);
static void esp32p4_uart_txint(struct uart_dev_s *dev, bool enable);
static bool esp32p4_uart_txready(struct uart_dev_s *dev);
static bool esp32p4_uart_txempty(struct uart_dev_s *dev);

/* Internal helper functions */

static void esp32p4_uart_configure(struct esp32p4_uart_port_s *port);
static void esp32p4_uart_sw_reset(struct esp32p4_uart_port_s *port);
static void esp32p4_uart_config_gpio(struct esp32p4_uart_port_s *port);
static void esp32p4_uart_set_baudrate(struct esp32p4_uart_port_s *port);

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* UART0 port descriptor */

#ifdef CONFIG_ESP32P4_UART0
static struct esp32p4_uart_port_s g_uart0_port =
{
  .base      = DR_REG_UART0_BASE,
  .irq       = ESP32P4_IRQ_UART0,
  .baud      = CONFIG_ESP32P4_UART0_BAUD,
  .clk_freq  = APB_CLK_FREQ_DEFAULT,
  .parity    = CONFIG_ESP32P4_UART0_PARITY,
  .bits      = CONFIG_ESP32P4_UART0_BITS,
  .stopbits2 = 0,  /* CONFIG_ESP32P4_UART0_2STOP not set */
  .tx_sig    = UART0_TX_SIG,
  .rx_sig    = UART0_RX_SIG,
  .tx_gpio   = CONFIG_ESP32P4_UART0_TX_GPIO,
  .rx_gpio   = CONFIG_ESP32P4_UART0_RX_GPIO,
};

