Geoorgiee/contest2026_324_xiaoqiaoliushui/vendor_esp32p4/chips/esp32p4/esp32p4_serial.c
static const struct uart_ops_s g_uart0_ops =
{
  .setup       = esp32p4_uart_setup,
  .shutdown    = esp32p4_uart_shutdown,
  .attach      = esp32p4_uart_attach,
  .detach      = esp32p4_uart_detach,
  .ioctl       = esp32p4_uart_ioctl,
  .receive     = esp32p4_uart_receive,
  .rxint       = esp32p4_uart_rxint,
  .rxavailable = esp32p4_uart_rxavailable,
#ifdef CONFIG_SERIAL_IFLOWCONTROL
  .rxflowcontrol = NULL,
#endif
  .send        = esp32p4_uart_send,
  .txint       = esp32p4_uart_txint,
  .txready     = esp32p4_uart_txready,
  .txempty     = esp32p4_uart_txempty,
};

static char g_uart0_rxbuffer[CONFIG_ESP32P4_UART0_RXBUFSIZE];
static char g_uart0_txbuffer[CONFIG_ESP32P4_UART0_TXBUFSIZE];

static struct uart_dev_s g_uart0_priv =
{
  .isconsole = (bool)CONFIG_ESP32P4_UART0_SERIAL_CONSOLE,
  .ops       = &g_uart0_ops,
  .xmit =
  {
    .size    = CONFIG_ESP32P4_UART0_TXBUFSIZE,
    .buffer  = g_uart0_txbuffer,
  },
  .recv =
  {
    .size    = CONFIG_ESP32P4_UART0_RXBUFSIZE,
    .buffer  = g_uart0_rxbuffer,
  },
  .priv      = &g_uart0_port,
};
#endif /* CONFIG_ESP32P4_UART0 */

/* UART1 port descriptor */

#ifdef CONFIG_ESP32P4_UART1
static struct esp32p4_uart_port_s g_uart1_port =
{
  .base      = DR_REG_UART1_BASE,
  .irq       = ESP32P4_IRQ_UART1,
  .baud      = CONFIG_ESP32P4_UART1_BAUD,
  .clk_freq  = APB_CLK_FREQ_DEFAULT,
  .parity    = CONFIG_ESP32P4_UART1_PARITY,
  .bits      = CONFIG_ESP32P4_UART1_BITS,
  .stopbits2 = 0,  /* CONFIG_ESP32P4_UART1_2STOP not set */
  .tx_sig    = UART1_TX_SIG,
  .rx_sig    = UART1_RX_SIG,
  .tx_gpio   = CONFIG_ESP32P4_UART1_TX_GPIO,
  .rx_gpio   = CONFIG_ESP32P4_UART1_RX_GPIO,
};

static const struct uart_ops_s g_uart1_ops =
{
  .setup       = esp32p4_uart_setup,
  .shutdown    = esp32p4_uart_shutdown,
  .attach      = esp32p4_uart_attach,
  .detach      = esp32p4_uart_detach,
  .ioctl       = esp32p4_uart_ioctl,
  .receive     = esp32p4_uart_receive,
  .rxint       = esp32p4_uart_rxint,
  .rxavailable = esp32p4_uart_rxavailable,
#ifdef CONFIG_SERIAL_IFLOWCONTROL
  .rxflowcontrol = NULL,
#endif
  .send        = esp32p4_uart_send,
  .txint       = esp32p4_uart_txint,
  .txready     = esp32p4_uart_txready,
  .txempty     = esp32p4_uart_txempty,
};

static char g_uart1_rxbuffer[CONFIG_ESP32P4_UART1_RXBUFSIZE];
static char g_uart1_txbuffer[CONFIG_ESP32P4_UART1_TXBUFSIZE];

static struct uart_dev_s g_uart1_priv =
{
  .isconsole = false,
  .ops       = &g_uart1_ops,
  .xmit =
  {
    .size    = CONFIG_ESP32P4_UART1_TXBUFSIZE,
    .buffer  = g_uart1_txbuffer,
  },
  .recv =
  {
    .size    = CONFIG_ESP32P4_UART1_RXBUFSIZE,
    .buffer  = g_uart1_rxbuffer,
  },
  .priv      = &g_uart1_port,
};
#endif /* CONFIG_ESP32P4_UART1 */

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: esp32p4_uart_sw_reset
 *
 * Description:
 *   Perform a software reset of the UART peripheral.
 *
 *   This resets the UART state machine, FIFOs, and configuration
 *   registers to their default values.  Modeled after the ESP-IDF
 *   uart_driver_install() sequence which resets the UART before
 *   configuration.
 *
 *   The ESP32-P4 UART does not have a dedicated software reset bit
 *   in the UART registers.  Instead, we reset through the clock and
 *   reset controller by toggling the peripheral reset bit.
 *
 ****************************************************************************/

static void esp32p4_uart_sw_reset(struct esp32p4_uart_port_s *port)
{
  /* Reset the TX and RX FIFOs by setting the reset bits in CONF0.
   * These bits are self-clearing on ESP32-P4.
   */

  REG_WRITE(port->base + UART_CONF0_REG,
            UART_TXFIFO_RST | UART_RXFIFO_RST);

  /* Clear all pending interrupts */

  REG_WRITE(port->base + UART_INT_CLR_REG, 0xffffffff);

  /* Disable all interrupts */

  REG_WRITE(port->base + UART_INT_ENA_REG, 0);
}

/****************************************************************************
 * Name: esp32p4_uart_set_baudrate
 *
 * Description:
 *   Configure the UART baud rate divisor.
 *
 *   The ESP32-P4 HP UART uses the APB clock as its source clock.
 *   The baud rate is determined by:
 *
 *     baud_rate = clk_freq / (CLKDIV_integer + CLKDIV_frag / 16)
 *
 *   The clock divider register has an integer part (20 bits) and a
 *   4-bit fractional part, giving fine-grained baud rate control.
 *   This matches the ESP-IDF uart_ll_set_baudrate() implementation.
 *
 *   Example: 115200 baud with 80 MHz APB clock:
 *     CLKDIV_full = 80000000 * 16 / 115200 = 11111.11
 *     Integer part = 11111 / 16 = 694 (0x2B6)
 *     Fractional part = 11111 % 16 = 7 (0x7)
 *
 ****************************************************************************/

static void esp32p4_uart_set_baudrate(struct esp32p4_uart_port_s *port)
{
  uint32_t clkdiv;

  /* Calculate full clock divider with 4-bit fractional precision.
   * clkdiv = (clk_freq << 4) / baud = clk_freq * 16 / baud
   * Integer part = clkdiv >> 4, fractional part = clkdiv & 0xf
   */

  clkdiv = (port->clk_freq << 4) / port->baud;

  /* Write the integer clock divider (20 bits) */

  REG_WRITE(port->base + UART_CLKDIV_REG, (clkdiv >> 4) & 0xfffff);

  /* Write the fractional clock divider (4 bits) */

  REG_WRITE(port->base + UART_CLKDIV_FRAG_REG, clkdiv & 0xf);
}

/****************************************************************************
 * Name: esp32p4_uart_config_gpio
 *
 * Description:
 *   Configure GPIO pins for UART TX and RX via the GPIO matrix.
 *
 *   The ESP32-P4 uses a GPIO matrix that allows any peripheral signal
 *   to be routed to any GPIO pin.  This function sets up the pin mux
 *   for the UART TX (output) and RX (input) signals.
 *
 *   This is modeled after ESP-IDF's uart_set_pin() and the GPIO
 *   configuration done in uart_driver_install().
 *
 *   TX pin configuration:
 *     - Set GPIO_FUNC_OUT_SEL_CFG_REG(pin) to route the UART TX
 *       signal to the pin
 *     - Configure pin as output
 *
 *   RX pin configuration:
 *     - Set GPIO_FUNC_IN_SEL_CFG_REG(signal) to route the pin to
 *       the UART RX input
 *     - Configure pin as input with pull-up enabled
 *
 ****************************************************************************/

static void esp32p4_uart_config_gpio(struct esp32p4_uart_port_s *port)
{
  uint32_t regval;

  /* Configure TX pin: route UART TX signal to GPIO output */

  regval = port->tx_sig & GPIO_FUNC_OUT_SEL_M;
  REG_WRITE(GPIO_FUNC_OUT_SEL_CFG_REG(port->tx_gpio), regval);

  /* Configure RX pin: route GPIO input to UART RX signal.
   * For input routing, we write the GPIO pin number to the
   * UART RX signal's input selection register.
   * Bit 7 (GPIO_FUNC_IN_SEL_HIGH) = 0 means the source is a
   * GPIO pin, not a constant.
   */

  regval = port->rx_gpio & 0x3f;
  REG_WRITE(GPIO_FUNC_IN_SEL_CFG_REG(port->rx_sig), regval);

