Geoorgiee/contest2026_324_xiaoqiaoliushui/vendor_esp32p4/chips/esp32p4/esp32p4_serial.c
  /* Configure TX pin as output (function 1 = GPIO output mode) */

  regval = REG_READ(GPIO_PIN_REG(port->tx_gpio));
  regval &= ~(0x3);   /* Clear bits [1:0] (direction) */
  regval |= GPIO_OUTPUT;
  REG_WRITE(GPIO_PIN_REG(port->tx_gpio), regval);

  /* Configure RX pin as input with pull-up to prevent floating */

  regval = REG_READ(GPIO_PIN_REG(port->rx_gpio));
  regval &= ~(0x3);   /* Clear bits [1:0] (direction) */
  regval |= GPIO_INPUT_PULLUP;
  REG_WRITE(GPIO_PIN_REG(port->rx_gpio), regval);
}

/****************************************************************************
 * Name: esp32p4_uart_configure
 *
 * Description:
 *   Configure the UART hardware with the specified parameters.
 *   This sets the baud rate, data bits, stop bits, parity, and
 *   FIFO thresholds.
 *
 *   The configuration sequence follows the ESP-IDF uart_param_config()
 *   pattern:
 *     1. Set clock divider for baud rate
 *     2. Configure data format in CONF0 (data bits, stop bits, parity)
 *     3. Configure FIFO thresholds and timeouts in CONF1
 *
 ****************************************************************************/

static void esp32p4_uart_configure(struct esp32p4_uart_port_s *port)
{
  uint32_t conf0;
  uint32_t conf1;

  /* Step 1: Set baud rate clock divider */

  esp32p4_uart_set_baudrate(port);

  /* Step 2: Reset FIFOs before configuration */

  REG_WRITE(port->base + UART_CONF0_REG,
            UART_TXFIFO_RST | UART_RXFIFO_RST);

  /* Step 3: Build CONF0 value with data format settings.
   * We build the entire register value and write it once to avoid
   * glitches from intermediate states.
   */

  conf0 = 0;

  /* Configure data bits (bits [3:2]) */

  switch (port->bits)
    {
      case 5:
        conf0 |= UART_BIT_NUM_5;
        break;
      case 6:
        conf0 |= UART_BIT_NUM_6;
        break;
      case 7:
        conf0 |= UART_BIT_NUM_7;
        break;
      case 8:
      default:
        conf0 |= UART_BIT_NUM_8;
        break;
    }

  /* Configure stop bits (bits [5:4]) */

  if (port->stopbits2)
    {
      conf0 |= UART_STOP_BIT_NUM_2;
    }
  else
    {
      conf0 |= UART_STOP_BIT_NUM_1;
    }

  /* Configure parity (bits [1:0])
   * PARITY bit selects even (0) or odd (1) parity.
   * PARITY_EN bit enables parity check.
   */

  if (port->parity != 0)
    {
      conf0 |= UART_PARITY_EN;
      if (port->parity == 1)  /* Odd parity */
        {
          conf0 |= UART_PARITY;
        }
    }

  REG_WRITE(port->base + UART_CONF0_REG, conf0);

  /* Step 4: Configure CONF1 register with FIFO thresholds and timeouts.
   *
   * RXFIFO_FULL_THRHD [bits 22:16] (7 bits): RX FIFO threshold for
   *   generating the RXFIFO_FULL interrupt.  We use 112 bytes
   *   (matching ESP-IDF default) to reduce interrupt overhead while
   *   still responding quickly.
   *
   * TXFIFO_EMPTY_THRHD [bits 29:23] (7 bits): TX FIFO threshold for
   *   generating the TXFIFO_EMPTY interrupt.  When the TX FIFO level
   *   drops below this threshold, the interrupt fires.  We use 8
   *   bytes to trigger the interrupt early enough to keep the TX
   *   FIFO fed.
   *
   * RX_TOUT_EN [6]: Enable RX FIFO timeout.  When enabled, an
   *   interrupt fires after RX_TOUT_THRHD idle bit periods with no
   *   new data.  This is essential for receiving data that doesn't
   *   fill the FIFO (e.g., interactive terminal input).
   *
   * RX_TOUT_THRHD [17:7] (11 bits): RX timeout threshold in UART
   *   symbol periods.  We use 2 (minimum useful value).
   */

  conf1 = (UART_RXFIFO_FULL_THRHD << UART_RXFIFO_FULL_THRHD_S) |
          (UART_TXFIFO_EMPTY_THRHD << UART_TXFIFO_EMPTY_THRHD_S) |
          UART_RX_TOUT_EN |
          (UART_RX_TOUT_THRHD << UART_RX_TOUT_THRHD_S);

  REG_WRITE(port->base + UART_CONF1_REG, conf1);

  /* Step 5: Configure idle character detection for robustness.
   *
   * The IDLE_CONF_REG controls the number of idle bit periods
   * before the UART considers the line idle.  This interacts with
   * the RX timeout mechanism.
   *   Pre-idle: 1 bit period before data
   *   Post-idle: 1 bit period after data
   *   Gap: 1 bit period between characters
   * These are reasonable defaults for most baud rates.
   */

  REG_WRITE(port->base + UART_IDLE_CONF_REG, (1 << 10) | (1 << 4) | 1);
}

/****************************************************************************
 * Name: esp32p4_uart_setup
 *
 * Description:
 *   Configure the UART.  This method is called the first time that the
 *   serial port is opened.
 *
 *   The setup sequence follows the ESP-IDF uart_driver_install() pattern:
 *     1. Software reset the UART module
 *     2. Configure GPIO pins for TX/RX
 *     3. Configure UART parameters (baud, format, FIFOs)
 *     4. Enable the UART receiver and transmitter
 *
 ****************************************************************************/

static int esp32p4_uart_setup(struct uart_dev_s *dev)
{
  struct esp32p4_uart_port_s *port = dev->priv;

  /* Step 1: Software reset to ensure clean state */

  esp32p4_uart_sw_reset(port);

  /* Step 2: Configure GPIO pins for UART TX/RX */

  esp32p4_uart_config_gpio(port);

  /* Step 3: Configure UART hardware (baud, format, FIFOs) */

  esp32p4_uart_configure(port);

  /* Step 4: Enable UART transmitter and receiver.
   * These bits in CONF0 enable the TX and RX state machines.
   * We read-modify-write to preserve the format settings we just wrote.
   */

  modifyreg32(port->base + UART_CONF0_REG, 0,
               (1 << 27) |  /* UART_TXFIFO_RST_CLR - ensure TX enabled */
               (1 << 28));  /* UART_RXFIFO_RST_CLR - ensure RX enabled */

  return OK;
}

/****************************************************************************
 * Name: esp32p4_uart_shutdown
 *
 * Description:
 *   Disable the UART.  This method is called when the serial port is
 *   closed.
 *
 *   Following the ESP-IDF uart_driver_delete() pattern:
 *     1. Disable all UART interrupts
 *     2. Reset the UART module to clean state
 *
 ****************************************************************************/

