Geoorgiee/contest2026_324_xiaoqiaoliushui/vendor_esp32p4/chips/esp32p4/esp32p4_serial.c
static void esp32p4_uart_shutdown(struct uart_dev_s *dev)
{
  struct esp32p4_uart_port_s *port = dev->priv;

  /* Disable all UART interrupts */

  REG_WRITE(port->base + UART_INT_ENA_REG, 0);

  /* Clear any pending interrupts */

  REG_WRITE(port->base + UART_INT_CLR_REG, 0xffffffff);

  /* Reset the UART FIFOs */

  REG_WRITE(port->base + UART_CONF0_REG,
            UART_TXFIFO_RST | UART_RXFIFO_RST);
}

/****************************************************************************
 * Name: esp32p4_uart_interrupt
 *
 * Description:
 *   UART interrupt handler.  This is called from the PLIC interrupt
 *   dispatch when a UART interrupt is detected.
 *
 *   The handler processes the following interrupt sources:
 *     - RXFIFO_FULL: RX FIFO has reached the full threshold
 *     - RXFIFO_TOUT: RX FIFO timeout (idle line detected)
 *     - TXFIFO_EMPTY: TX FIFO has dropped below empty threshold
 *     - Parity error, frame error, RX FIFO overflow (cleared to
 *       prevent interrupt storms)
 *
 *   This matches the ESP-IDF uart_rx_intr_handler_default() pattern
 *   where the handler reads the masked interrupt status, processes
 *   data events, clears all interrupts, and returns.
 *
 ****************************************************************************/

static int esp32p4_uart_interrupt(int irq, void *context, void *arg)
{
  struct uart_dev_s *dev = (struct uart_dev_s *)arg;
  struct esp32p4_uart_port_s *port;
  uint32_t int_status;

  DEBUGASSERT(dev != NULL && dev->priv != NULL);
  port = dev->priv;

  /* Read the masked interrupt status register.
   * This only shows interrupts that are both pending AND enabled.
   */

  int_status = REG_READ(port->base + UART_INT_ST_REG);

  /* Handle RX data available: both FIFO-full and timeout events.
   *
   * The RX timeout interrupt is particularly important for
   * interactive terminal use: it fires when data stops arriving
   * (e.g., after a line of input), even if the FIFO isn't full.
   * This matches ESP-IDF's handling in uart_rx_intr_handler_default()
   * where both UART_RXFIFO_FULL_INT_ST and UART_RXFIFO_TOUT_INT_ST
   * trigger uart_recvchars().
   */

  if (int_status & (UART_RXFIFO_FULL_INT_RAW | UART_RXFIFO_TOUT_INT_RAW))
    {
      uart_recvchars(dev);
    }

  /* Handle TX FIFO empty.
   *
   * When the TX FIFO level drops below the empty threshold, we
   * refill it from the software transmit buffer via uart_xmitchars().
   */

  if (int_status & UART_TXFIFO_EMPTY_INT_RAW)
    {
      uart_xmitchars(dev);
    }

  /* Handle error conditions.
   *
   * We clear error interrupt flags to prevent interrupt storms.
   * The actual error reporting happens in esp32p4_uart_receive()
   * which checks the STATUS register for error flags.
   */

  if (int_status & (UART_PARITY_ERR_INT_RAW |
                     UART_FRM_ERR_INT_RAW |
                     UART_RXFIFO_OVF_INT_RAW))
    {
      /* Log the error for debugging */

      _err("UART%d error: status=0x%08" PRIx32 "\n",
           (port->base == DR_REG_UART0_BASE) ? 0 : 1,
           int_status & (UART_PARITY_ERR_INT_RAW |
                         UART_FRM_ERR_INT_RAW |
                         UART_RXFIFO_OVF_INT_RAW));
    }

  /* Clear all pending interrupts by writing to the clear register.
   * This acknowledges all interrupt sources at once, which is the
   * recommended pattern for the ESP32-P4 UART.
   */

  REG_WRITE(port->base + UART_INT_CLR_REG, int_status);

  return OK;
}

/****************************************************************************
 * Name: esp32p4_uart_attach
 *
 * Description:
 *   Configure the UART to interrupt on RX data available.
 *   This registers the interrupt handler with the PLIC and is
 *   called when the serial port is opened.
 *
 ****************************************************************************/

static int esp32p4_uart_attach(struct uart_dev_s *dev)
{
  struct esp32p4_uart_port_s *port = dev->priv;

  /* Attach the UART interrupt handler to the PLIC */

  return irq_attach(port->irq, esp32p4_uart_interrupt, dev);
}

/****************************************************************************
 * Name: esp32p4_uart_detach
 *
 * Description:
 *   Detach the UART interrupt handler.
 *   This is called when the serial port is closed.
 *
 ****************************************************************************/

static void esp32p4_uart_detach(struct uart_dev_s *dev)
{
  struct esp32p4_uart_port_s *port = dev->priv;

  /* Disable all UART interrupts */

  REG_WRITE(port->base + UART_INT_ENA_REG, 0);

  /* Detach the interrupt handler from the PLIC */

  irq_attach(port->irq, NULL, NULL);
}

/****************************************************************************
 * Name: esp32p4_uart_ioctl
 *
 * Description:
 *   All ioctl calls will be routed through this method.
 *
 *   Supported commands:
 *     TCGETS - Get terminal attributes (data bits, stop bits, parity)
 *     TCSETS - Set terminal attributes (data bits, stop bits, parity,
 *              baud rate via CBAUD/CBAUDEX)
 *
 ****************************************************************************/

static int esp32p4_uart_ioctl(FAR struct file *filep, int cmd,
                               unsigned long arg)
{
  FAR struct inode *inode = filep->f_inode;
  FAR struct uart_dev_s *dev = inode->i_private;
  struct esp32p4_uart_port_s *port = dev->priv;

  switch (cmd)
    {
      case TCGETS:
        {
          struct termios *termiosp = (struct termios *)(uintptr_t)arg;

          if (termiosp == NULL)
            {
              return -EINVAL;
            }

          memset(termiosp, 0, sizeof(struct termios));

          /* Data bits */

          switch (port->bits)
            {
              case 5:
                termiosp->c_cflag |= CS5;
                break;
              case 6:
                termiosp->c_cflag |= CS6;
                break;
              case 7:
                termiosp->c_cflag |= CS7;
                break;
              case 8:
              default:
                termiosp->c_cflag |= CS8;
                break;
            }

          /* Stop bits */

          if (port->stopbits2)
            {
              termiosp->c_cflag |= CSTOPB;
            }

          /* Parity */

          if (port->parity != 0)
            {
              termiosp->c_cflag |= PARENB;
              if (port->parity == 1)  /* Odd parity */
                {
                  termiosp->c_cflag |= PARODD;
                }
            }

          /* Baud rate - store in c_ispeed/c_ospeed */

          termiosp->c_speed = port->baud;
          termiosp->c_speed = port->baud;

          /* Input flags - enable basic processing */

          termiosp->c_iflag = 0;

          /* Output flags */

          termiosp->c_oflag = 0;

          /* Local flags */

          termiosp->c_lflag = 0;

          return OK;
        }

      case TCSETS:
        {
          struct termios *termiosp = (struct termios *)(uintptr_t)arg;
          bool need_reconfig = false;

          if (termiosp == NULL)
            {
              return -EINVAL;
            }

