Geoorgiee/contest2026_324_xiaoqiaoliushui/vendor_esp32p4/chips/esp32p4/esp32p4_serial.c
          /* Data bits */

          switch (termiosp->c_cflag & CSIZE)
            {
              case CS5:
                if (port->bits != 5)
                  {
                    port->bits = 5;
                    need_reconfig = true;
                  }
                break;
              case CS6:
                if (port->bits != 6)
                  {
                    port->bits = 6;
                    need_reconfig = true;
                  }
                break;
              case CS7:
                if (port->bits != 7)
                  {
                    port->bits = 7;
                    need_reconfig = true;
                  }
                break;
              case CS8:
              default:
                if (port->bits != 8)
                  {
                    port->bits = 8;
                    need_reconfig = true;
                  }
                break;
            }

          /* Stop bits */

          {
            bool stopbits2 = (termiosp->c_cflag & CSTOPB) ? true : false;
            if (port->stopbits2 != stopbits2)
              {
                port->stopbits2 = stopbits2;
                need_reconfig = true;
              }
          }

          /* Parity */

          {
            uint8_t newparity;
            if (termiosp->c_cflag & PARENB)
              {
                newparity = (termiosp->c_cflag & PARODD) ? 1 : 2;
              }
            else
              {
                newparity = 0;
              }

            if (port->parity != newparity)
              {
                port->parity = newparity;
                need_reconfig = true;
              }
          }

          /* Baud rate - check if the caller is requesting a change.
           * We accept baud rate through c_ispeed/c_ospeed fields.
           * If either is non-zero and differs from the current baud
           * rate, we update the port and reconfigure.
           */

          if (termiosp->c_speed != 0 && termiosp->c_speed != port->baud)
            {
              port->baud = termiosp->c_speed;
              need_reconfig = true;
            }

          /* Reconfigure hardware if settings changed.
           * We reconfigure the entire UART to ensure all settings
           * are applied consistently, matching the ESP-IDF pattern
           * of calling uart_param_config() which reconfigures
           * everything at once.
           */

          if (need_reconfig)
            {
              esp32p4_uart_configure(port);
            }

          return OK;
        }

      default:
        return -ENOTTY;
    }
}

/****************************************************************************
 * Name: esp32p4_uart_receive
 *
 * Description:
 *   Called (usually) from the interrupt handler to receive one byte from
 *   the UART data register.
 *
 *   The status parameter returns error flags from the UART status
 *   register, which the upper-half serial driver uses to report
 *   errors to the application:
 *     - Parity error
 *     - Framing error
 *     - RX FIFO overflow
 *
 *   This matches the ESP-IDF uart_read_bytes() pattern where error
 *   flags are checked alongside the received data.
 *
 ****************************************************************************/

static int esp32p4_uart_receive(struct uart_dev_s *dev, unsigned int *status)
{
  struct esp32p4_uart_port_s *port = dev->priv;
  uint32_t regval;

  /* Read the UART status register for error detection.
   * The status register contains:
   *   Bits [15:0]  : RX FIFO count
   *   Bits [23:16] : TX FIFO count
   *   Bit  [30]    : RX FIFO overflow flag (sticky until cleared)
   *
   * We also check the raw interrupt register for parity and framing
   * errors, as these are latched there.
   */

  *status = 0;

  regval = REG_READ(port->base + UART_INT_RAW_REG);

  if (regval & UART_PARITY_ERR_INT_RAW)
    {
      *status |= UART_PARITY_ERR_INT_RAW;
    }

  if (regval & UART_FRM_ERR_INT_RAW)
    {
      *status |= UART_FRM_ERR_INT_RAW;
    }

  if (regval & UART_RXFIFO_OVF_INT_RAW)
    {
      *status |= UART_RXFIFO_OVF_INT_RAW;
    }

  /* Read the byte from the FIFO register.
   * The FIFO register is 8 bits wide for data.  Reading from this
   * register pops one byte from the RX FIFO.
   */

  regval = REG_READ(port->base + UART_FIFO_REG);

  return (int)(regval & 0xff);
}

/****************************************************************************
 * Name: esp32p4_uart_rxint
 *
 * Description:
 *   Call to enable or disable RX interrupts.
 *
 *   When enabled, the following interrupt sources are activated:
 *     - RXFIFO_FULL: fires when RX FIFO reaches the full threshold
 *     - RXFIFO_TOUT: fires after idle timeout with data in FIFO
 *
 *   The RX timeout is critical for interactive use: it ensures that
 *   data is delivered even when the line has fewer bytes than the
 *   FIFO threshold.  This matches the ESP-IDF pattern of enabling
 *   both interrupts in uart_driver_install().
 *
 ****************************************************************************/

static void esp32p4_uart_rxint(struct uart_dev_s *dev, bool enable)
{
  struct esp32p4_uart_port_s *port = dev->priv;

  if (enable)
    {
      /* Enable RX FIFO full and RX timeout interrupts.
       * REG_SET_BIT uses a critical section internally for
       * atomic read-modify-write.
       */

      REG_SET_BIT(port->base + UART_INT_ENA_REG,
                  UART_RXFIFO_FULL_INT_RAW | UART_RXFIFO_TOUT_INT_RAW);
    }
  else
    {
      /* Disable RX FIFO full and RX timeout interrupts */

      REG_CLR_BIT(port->base + UART_INT_ENA_REG,
                  UART_RXFIFO_FULL_INT_RAW | UART_RXFIFO_TOUT_INT_RAW);
    }
}

/****************************************************************************
 * Name: esp32p4_uart_rxavailable
 *
 * Description:
 *   Return true if the receive FIFO is not empty.
 *
 *   The RX FIFO count is in bits [15:0] of the STATUS register.
 *   This matches the ESP-IDF uart_ll_get_rxfifo_len() which reads
 *   the same field.
 *
 ****************************************************************************/

static bool esp32p4_uart_rxavailable(struct uart_dev_s *dev)
{
  struct esp32p4_uart_port_s *port = dev->priv;
  uint32_t status;

