Geoorgiee/contest2026_324_xiaoqiaoliushui/vendor_esp32p4/chips/esp32p4/esp32p4_serial.c
  /* Check the RX FIFO count from the status register */

  status = REG_READ(port->base + UART_STATUS_REG);

  /* RX FIFO count is in bits [15:0] of the status register.
   * If non-zero, data is available.
   */

  return ((status & 0xffff) != 0);
}

/****************************************************************************
 * Name: esp32p4_uart_send
 *
 * Description:
 *   This method will send one byte on the UART.
 *
 *   The caller (uart_xmitchars) has already verified that the TX FIFO
 *   is not full via txready() before calling this function.
 *
 ****************************************************************************/

static void esp32p4_uart_send(struct uart_dev_s *dev, int ch)
{
  struct esp32p4_uart_port_s *port = dev->priv;

  /* Write the character to the TX FIFO.
   * The FIFO register is 8 bits wide; writing pushes one byte
   * into the TX FIFO.
   */

  REG_WRITE(port->base + UART_FIFO_REG, (uint32_t)(ch & 0xff));
}

/****************************************************************************
 * Name: esp32p4_uart_txint
 *
 * Description:
 *   Call to enable or disable TX interrupts.
 *
 *   When enabled, the TXFIFO_EMPTY interrupt fires when the TX FIFO
 *   level drops below the empty threshold (configured in CONF1).
 *   This triggers uart_xmitchars() to refill the FIFO from the
 *   software transmit buffer.
 *
 ****************************************************************************/

static void esp32p4_uart_txint(struct uart_dev_s *dev, bool enable)
{
  struct esp32p4_uart_port_s *port = dev->priv;

  if (enable)
    {
      REG_SET_BIT(port->base + UART_INT_ENA_REG,
                  UART_TXFIFO_EMPTY_INT_RAW);
    }
  else
    {
      REG_CLR_BIT(port->base + UART_INT_ENA_REG,
                  UART_TXFIFO_EMPTY_INT_RAW);
    }
}

/****************************************************************************
 * Name: esp32p4_uart_txready
 *
 * Description:
 *   Return true if the transmit FIFO is not full.
 *
 *   The TX FIFO count is in bits [23:16] of the STATUS register.
 *   The FIFO is 128 bytes deep.  If the count is less than the
 *   maximum, we can accept more data.
 *
 ****************************************************************************/

static bool esp32p4_uart_txready(struct uart_dev_s *dev)
{
  struct esp32p4_uart_port_s *port = dev->priv;
  uint32_t status;

  /* Check the TX FIFO count from the status register */

  status = REG_READ(port->base + UART_STATUS_REG);

  /* TX FIFO count is in bits [23:16].
   * The FIFO is UART_FIFO_MAX (128) bytes deep; if not full,
   * we can send.
   */

  return ((status >> 16) & 0xff) < UART_FIFO_MAX;
}

/****************************************************************************
 * Name: esp32p4_uart_txempty
 *
 * Description:
 *   Return true if the transmit FIFO is empty.
 *
 *   This is used by the upper half to determine when it is safe to
 *   shut down the UART (all data has been transmitted).
 *
 ****************************************************************************/

static bool esp32p4_uart_txempty(struct uart_dev_s *dev)
{
  struct esp32p4_uart_port_s *port = dev->priv;
  uint32_t status;

  /* Check if TX FIFO is empty */

  status = REG_READ(port->base + UART_STATUS_REG);

  return ((status >> 16) & 0xff) == 0;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: riscv_earlyserialinit
 *
 * Description:
 *   Performs the low level UART initialization early in debug so that the
 *   serial console will be available during bootup.  This must be called
 *   before riscv_serialinit.
 *
 *   The early console was already set up by the boot ROM for basic
 *   debug output.  We configure the driver structures here so they
 *   are ready when the full serial subsystem comes up.
 *
 ****************************************************************************/

void riscv_earlyserialinit(void)
{
  /* NOTE: All function pointers are already assigned in the static
   * structure initializers above.  The boot ROM has already configured
   * UART0 at 115200 baud for early debug output.
   */
}

/****************************************************************************
 * Name: riscv_serialinit
 *
 * Description:
 *   Register serial console and serial ports.  This assumes that
 *   riscv_earlyserialinit was called previously.
 *
 ****************************************************************************/

void riscv_serialinit(void)
{
  /* Register UART0 as console */

#ifdef CONFIG_ESP32P4_UART0
  uart_register("/dev/console", &g_uart0_priv);
#endif

  /* Register UART1 if configured */

#ifdef CONFIG_ESP32P4_UART1
  uart_register("/dev/ttyS1", &g_uart1_priv);
#endif
}

/****************************************************************************
 * Name: up_putc
 *
 * Description:
 *   Output a byte on the serial console.
 *
 *   This function sends a character directly to the UART0 TX FIFO,
 *   waiting for space to become available.  It also handles the
 *   CR-LF conversion: a newline character ('\n') is preceded by
 *   a carriage return ('\r') to produce proper line endings on
 *   serial terminals.
 *
 ****************************************************************************/

void up_putc(int ch)
{
#ifdef CONFIG_ESP32P4_UART0_SERIAL_CONSOLE
  uint32_t status;

  /* For newline, send CR first (standard serial terminal convention) */

  if (ch == '\n')
    {
      /* Wait for TX FIFO to have space */

      do
        {
          status = REG_READ(DR_REG_UART0_BASE + UART_STATUS_REG);
        }
      while (((status >> 16) & 0xff) >= UART_FIFO_MAX);

      REG_WRITE(DR_REG_UART0_BASE + UART_FIFO_REG, (uint32_t)'\r');
    }

  /* Wait for TX FIFO to have space */

  do
    {
      status = REG_READ(DR_REG_UART0_BASE + UART_STATUS_REG);
    }
  while (((status >> 16) & 0xff) >= UART_FIFO_MAX);

  /* Write the character */

  REG_WRITE(DR_REG_UART0_BASE + UART_FIFO_REG, (uint32_t)(ch & 0xff));
#endif
}

/****************************************************************************
 * Name: up_lowputc
 *
 * Description:
 *   Output a byte on the serial console (low-level, no interrupts).
 *   This is used for early boot debug output before the serial
 *   subsystem is initialized.
 *
 ****************************************************************************/

void up_lowputc(int ch)
{
#ifdef CONFIG_ESP32P4_UART0_SERIAL_CONSOLE
  uint32_t status;

  /* For newline, send CR first (standard serial terminal convention) */

  if (ch == '\n')
    {
      do
        {
          status = REG_READ(DR_REG_UART0_BASE + UART_STATUS_REG);
        }
      while (((status >> 16) & 0xff) >= UART_FIFO_MAX);

      REG_WRITE(DR_REG_UART0_BASE + UART_FIFO_REG, (uint32_t)'\r');
    }

  /* Wait for TX FIFO to have space */

  do
    {
      status = REG_READ(DR_REG_UART0_BASE + UART_STATUS_REG);
    }
  while (((status >> 16) & 0xff) >= UART_FIFO_MAX);

  /* Write the character */

  REG_WRITE(DR_REG_UART0_BASE + UART_FIFO_REG, (uint32_t)(ch & 0xff));
#endif
}
